app/controllers/books_controller.rb

INSERT INTO "books" ("name", "author", "price", "company", "isbn_code", "day", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "cover" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["cover", ""], ["updated_at", "2015-06-06 10:21:48.731902"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)